c4deszes/atsame54-hal/atsame54-core/include/component/sdhc.h
/* -------- SDHC_CR : (SDHC Offset: 0x0E) (R/W 16) Command -------- */
#define SDHC_CR_RESETVALUE                    _U_(0x00)                                            /**<  (SDHC_CR) Command  Reset Value */

#define SDHC_CR_RESPTYP_Pos                   _U_(0)                                               /**< (SDHC_CR) Response Type Position */
#define SDHC_CR_RESPTYP_Msk                   (_U_(0x3) << SDHC_CR_RESPTYP_Pos)                    /**< (SDHC_CR) Response Type Mask */
#define SDHC_CR_RESPTYP(value)                (SDHC_CR_RESPTYP_Msk & ((value) << SDHC_CR_RESPTYP_Pos))
#define   SDHC_CR_RESPTYP_NONE_Val            _U_(0x0)                                             /**< (SDHC_CR) No response  */
#define   SDHC_CR_RESPTYP_136_BIT_Val         _U_(0x1)                                             /**< (SDHC_CR) 136-bit response  */
#define   SDHC_CR_RESPTYP_48_BIT_Val          _U_(0x2)                                             /**< (SDHC_CR) 48-bit response  */
#define   SDHC_CR_RESPTYP_48_BIT_BUSY_Val     _U_(0x3)                                             /**< (SDHC_CR) 48-bit response check busy after response  */
#define SDHC_CR_RESPTYP_NONE                  (SDHC_CR_RESPTYP_NONE_Val << SDHC_CR_RESPTYP_Pos)    /**< (SDHC_CR) No response Position  */
#define SDHC_CR_RESPTYP_136_BIT               (SDHC_CR_RESPTYP_136_BIT_Val << SDHC_CR_RESPTYP_Pos) /**< (SDHC_CR) 136-bit response Position  */
#define SDHC_CR_RESPTYP_48_BIT                (SDHC_CR_RESPTYP_48_BIT_Val << SDHC_CR_RESPTYP_Pos)  /**< (SDHC_CR) 48-bit response Position  */
#define SDHC_CR_RESPTYP_48_BIT_BUSY           (SDHC_CR_RESPTYP_48_BIT_BUSY_Val << SDHC_CR_RESPTYP_Pos) /**< (SDHC_CR) 48-bit response check busy after response Position  */
#define SDHC_CR_CMDCCEN_Pos                   _U_(3)                                               /**< (SDHC_CR) Command CRC Check Enable Position */
#define SDHC_CR_CMDCCEN_Msk                   (_U_(0x1) << SDHC_CR_CMDCCEN_Pos)                    /**< (SDHC_CR) Command CRC Check Enable Mask */
#define SDHC_CR_CMDCCEN(value)                (SDHC_CR_CMDCCEN_Msk & ((value) << SDHC_CR_CMDCCEN_Pos))
#define   SDHC_CR_CMDCCEN_DISABLE_Val         _U_(0x0)                                             /**< (SDHC_CR) Disable  */
#define   SDHC_CR_CMDCCEN_ENABLE_Val          _U_(0x1)                                             /**< (SDHC_CR) Enable  */
#define SDHC_CR_CMDCCEN_DISABLE               (SDHC_CR_CMDCCEN_DISABLE_Val << SDHC_CR_CMDCCEN_Pos) /**< (SDHC_CR) Disable Position  */
#define SDHC_CR_CMDCCEN_ENABLE                (SDHC_CR_CMDCCEN_ENABLE_Val << SDHC_CR_CMDCCEN_Pos)  /**< (SDHC_CR) Enable Position  */
#define SDHC_CR_CMDICEN_Pos                   _U_(4)                                               /**< (SDHC_CR) Command Index Check Enable Position */
#define SDHC_CR_CMDICEN_Msk                   (_U_(0x1) << SDHC_CR_CMDICEN_Pos)                    /**< (SDHC_CR) Command Index Check Enable Mask */
#define SDHC_CR_CMDICEN(value)                (SDHC_CR_CMDICEN_Msk & ((value) << SDHC_CR_CMDICEN_Pos))
#define   SDHC_CR_CMDICEN_DISABLE_Val         _U_(0x0)                                             /**< (SDHC_CR) Disable  */
#define   SDHC_CR_CMDICEN_ENABLE_Val          _U_(0x1)                                             /**< (SDHC_CR) Enable  */
#define SDHC_CR_CMDICEN_DISABLE               (SDHC_CR_CMDICEN_DISABLE_Val << SDHC_CR_CMDICEN_Pos) /**< (SDHC_CR) Disable Position  */
#define SDHC_CR_CMDICEN_ENABLE                (SDHC_CR_CMDICEN_ENABLE_Val << SDHC_CR_CMDICEN_Pos)  /**< (SDHC_CR) Enable Position  */
#define SDHC_CR_DPSEL_Pos                     _U_(5)                                               /**< (SDHC_CR) Data Present Select Position */
#define SDHC_CR_DPSEL_Msk                     (_U_(0x1) << SDHC_CR_DPSEL_Pos)                      /**< (SDHC_CR) Data Present Select Mask */
#define SDHC_CR_DPSEL(value)                  (SDHC_CR_DPSEL_Msk & ((value) << SDHC_CR_DPSEL_Pos))
#define   SDHC_CR_DPSEL_NO_DATA_Val           _U_(0x0)                                             /**< (SDHC_CR) No Data Present  */
#define   SDHC_CR_DPSEL_DATA_Val              _U_(0x1)                                             /**< (SDHC_CR) Data Present  */
#define SDHC_CR_DPSEL_NO_DATA                 (SDHC_CR_DPSEL_NO_DATA_Val << SDHC_CR_DPSEL_Pos)     /**< (SDHC_CR) No Data Present Position  */
#define SDHC_CR_DPSEL_DATA                    (SDHC_CR_DPSEL_DATA_Val << SDHC_CR_DPSEL_Pos)        /**< (SDHC_CR) Data Present Position  */
#define SDHC_CR_CMDTYP_Pos                    _U_(6)                                               /**< (SDHC_CR) Command Type Position */
#define SDHC_CR_CMDTYP_Msk                    (_U_(0x3) << SDHC_CR_CMDTYP_Pos)                     /**< (SDHC_CR) Command Type Mask */
#define SDHC_CR_CMDTYP(value)                 (SDHC_CR_CMDTYP_Msk & ((value) << SDHC_CR_CMDTYP_Pos))
#define   SDHC_CR_CMDTYP_NORMAL_Val           _U_(0x0)                                             /**< (SDHC_CR) Other commands  */
#define   SDHC_CR_CMDTYP_SUSPEND_Val          _U_(0x1)                                             /**< (SDHC_CR) CMD52 for writing Bus Suspend in CCCR  */
#define   SDHC_CR_CMDTYP_RESUME_Val           _U_(0x2)                                             /**< (SDHC_CR) CMD52 for writing Function Select in CCCR  */
#define   SDHC_CR_CMDTYP_ABORT_Val            _U_(0x3)                                             /**< (SDHC_CR) CMD12, CMD52 for writing I/O Abort in CCCR  */
#define SDHC_CR_CMDTYP_NORMAL                 (SDHC_CR_CMDTYP_NORMAL_Val << SDHC_CR_CMDTYP_Pos)    /**< (SDHC_CR) Other commands Position  */
#define SDHC_CR_CMDTYP_SUSPEND                (SDHC_CR_CMDTYP_SUSPEND_Val << SDHC_CR_CMDTYP_Pos)   /**< (SDHC_CR) CMD52 for writing Bus Suspend in CCCR Position  */
#define SDHC_CR_CMDTYP_RESUME                 (SDHC_CR_CMDTYP_RESUME_Val << SDHC_CR_CMDTYP_Pos)    /**< (SDHC_CR) CMD52 for writing Function Select in CCCR Position  */
#define SDHC_CR_CMDTYP_ABORT                  (SDHC_CR_CMDTYP_ABORT_Val << SDHC_CR_CMDTYP_Pos)     /**< (SDHC_CR) CMD12, CMD52 for writing I/O Abort in CCCR Position  */
#define SDHC_CR_CMDIDX_Pos                    _U_(8)                                               /**< (SDHC_CR) Command Index Position */
#define SDHC_CR_CMDIDX_Msk                    (_U_(0x3F) << SDHC_CR_CMDIDX_Pos)                    /**< (SDHC_CR) Command Index Mask */
#define SDHC_CR_CMDIDX(value)                 (SDHC_CR_CMDIDX_Msk & ((value) << SDHC_CR_CMDIDX_Pos))
#define SDHC_CR_Msk                           _U_(0x3FFB)                                          /**< (SDHC_CR) Register Mask  */


/* -------- SDHC_RR : (SDHC Offset: 0x10) ( R/ 32) Response -------- */
#define SDHC_RR_RESETVALUE                    _U_(0x00)                                            /**<  (SDHC_RR) Response  Reset Value */

#define SDHC_RR_CMDRESP_Pos                   _U_(0)                                               /**< (SDHC_RR) Command Response Position */
#define SDHC_RR_CMDRESP_Msk                   (_U_(0xFFFFFFFF) << SDHC_RR_CMDRESP_Pos)             /**< (SDHC_RR) Command Response Mask */
#define SDHC_RR_CMDRESP(value)                (SDHC_RR_CMDRESP_Msk & ((value) << SDHC_RR_CMDRESP_Pos))
#define SDHC_RR_Msk                           _U_(0xFFFFFFFF)                                      /**< (SDHC_RR) Register Mask  */


/* -------- SDHC_BDPR : (SDHC Offset: 0x20) (R/W 32) Buffer Data Port -------- */
#define SDHC_BDPR_RESETVALUE                  _U_(0x00)                                            /**<  (SDHC_BDPR) Buffer Data Port  Reset Value */

#define SDHC_BDPR_BUFDATA_Pos                 _U_(0)                                               /**< (SDHC_BDPR) Buffer Data Position */
#define SDHC_BDPR_BUFDATA_Msk                 (_U_(0xFFFFFFFF) << SDHC_BDPR_BUFDATA_Pos)           /**< (SDHC_BDPR) Buffer Data Mask */
#define SDHC_BDPR_BUFDATA(value)              (SDHC_BDPR_BUFDATA_Msk & ((value) << SDHC_BDPR_BUFDATA_Pos))
#define SDHC_BDPR_Msk                         _U_(0xFFFFFFFF)                                      /**< (SDHC_BDPR) Register Mask  */


/* -------- SDHC_PSR : (SDHC Offset: 0x24) ( R/ 32) Present State -------- */
#define SDHC_PSR_RESETVALUE                   _U_(0xF80000)                                        /**<  (SDHC_PSR) Present State  Reset Value */

