c4deszes/atsame54-hal/atsame54-core/include/component/sdhc.h
/* -------- SDHC_EISTR : (SDHC Offset: 0x32) (R/W 16) Error Interrupt Status -------- */
#define SDHC_EISTR_RESETVALUE                 _U_(0x00)                                            /**<  (SDHC_EISTR) Error Interrupt Status  Reset Value */

#define SDHC_EISTR_CMDTEO_Pos                 _U_(0)                                               /**< (SDHC_EISTR) Command Timeout Error Position */
#define SDHC_EISTR_CMDTEO_Msk                 (_U_(0x1) << SDHC_EISTR_CMDTEO_Pos)                  /**< (SDHC_EISTR) Command Timeout Error Mask */
#define SDHC_EISTR_CMDTEO(value)              (SDHC_EISTR_CMDTEO_Msk & ((value) << SDHC_EISTR_CMDTEO_Pos))
#define   SDHC_EISTR_CMDTEO_NO_Val            _U_(0x0)                                             /**< (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_CMDTEO_YES_Val           _U_(0x1)                                             /**< (SDHC_EISTR) Timeout  */
#define SDHC_EISTR_CMDTEO_NO                  (SDHC_EISTR_CMDTEO_NO_Val << SDHC_EISTR_CMDTEO_Pos)  /**< (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_CMDTEO_YES                 (SDHC_EISTR_CMDTEO_YES_Val << SDHC_EISTR_CMDTEO_Pos) /**< (SDHC_EISTR) Timeout Position  */
#define SDHC_EISTR_CMDCRC_Pos                 _U_(1)                                               /**< (SDHC_EISTR) Command CRC Error Position */
#define SDHC_EISTR_CMDCRC_Msk                 (_U_(0x1) << SDHC_EISTR_CMDCRC_Pos)                  /**< (SDHC_EISTR) Command CRC Error Mask */
#define SDHC_EISTR_CMDCRC(value)              (SDHC_EISTR_CMDCRC_Msk & ((value) << SDHC_EISTR_CMDCRC_Pos))
#define   SDHC_EISTR_CMDCRC_NO_Val            _U_(0x0)                                             /**< (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_CMDCRC_YES_Val           _U_(0x1)                                             /**< (SDHC_EISTR) CRC Error Generated  */
#define SDHC_EISTR_CMDCRC_NO                  (SDHC_EISTR_CMDCRC_NO_Val << SDHC_EISTR_CMDCRC_Pos)  /**< (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_CMDCRC_YES                 (SDHC_EISTR_CMDCRC_YES_Val << SDHC_EISTR_CMDCRC_Pos) /**< (SDHC_EISTR) CRC Error Generated Position  */
#define SDHC_EISTR_CMDEND_Pos                 _U_(2)                                               /**< (SDHC_EISTR) Command End Bit Error Position */
#define SDHC_EISTR_CMDEND_Msk                 (_U_(0x1) << SDHC_EISTR_CMDEND_Pos)                  /**< (SDHC_EISTR) Command End Bit Error Mask */
#define SDHC_EISTR_CMDEND(value)              (SDHC_EISTR_CMDEND_Msk & ((value) << SDHC_EISTR_CMDEND_Pos))
#define   SDHC_EISTR_CMDEND_NO_Val            _U_(0x0)                                             /**< (SDHC_EISTR) No error  */
#define   SDHC_EISTR_CMDEND_YES_Val           _U_(0x1)                                             /**< (SDHC_EISTR) End Bit Error Generated  */
#define SDHC_EISTR_CMDEND_NO                  (SDHC_EISTR_CMDEND_NO_Val << SDHC_EISTR_CMDEND_Pos)  /**< (SDHC_EISTR) No error Position  */
#define SDHC_EISTR_CMDEND_YES                 (SDHC_EISTR_CMDEND_YES_Val << SDHC_EISTR_CMDEND_Pos) /**< (SDHC_EISTR) End Bit Error Generated Position  */
#define SDHC_EISTR_CMDIDX_Pos                 _U_(3)                                               /**< (SDHC_EISTR) Command Index Error Position */
#define SDHC_EISTR_CMDIDX_Msk                 (_U_(0x1) << SDHC_EISTR_CMDIDX_Pos)                  /**< (SDHC_EISTR) Command Index Error Mask */
#define SDHC_EISTR_CMDIDX(value)              (SDHC_EISTR_CMDIDX_Msk & ((value) << SDHC_EISTR_CMDIDX_Pos))
#define   SDHC_EISTR_CMDIDX_NO_Val            _U_(0x0)                                             /**< (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_CMDIDX_YES_Val           _U_(0x1)                                             /**< (SDHC_EISTR) Error  */
#define SDHC_EISTR_CMDIDX_NO                  (SDHC_EISTR_CMDIDX_NO_Val << SDHC_EISTR_CMDIDX_Pos)  /**< (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_CMDIDX_YES                 (SDHC_EISTR_CMDIDX_YES_Val << SDHC_EISTR_CMDIDX_Pos) /**< (SDHC_EISTR) Error Position  */
#define SDHC_EISTR_DATTEO_Pos                 _U_(4)                                               /**< (SDHC_EISTR) Data Timeout Error Position */
#define SDHC_EISTR_DATTEO_Msk                 (_U_(0x1) << SDHC_EISTR_DATTEO_Pos)                  /**< (SDHC_EISTR) Data Timeout Error Mask */
#define SDHC_EISTR_DATTEO(value)              (SDHC_EISTR_DATTEO_Msk & ((value) << SDHC_EISTR_DATTEO_Pos))
#define   SDHC_EISTR_DATTEO_NO_Val            _U_(0x0)                                             /**< (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_DATTEO_YES_Val           _U_(0x1)                                             /**< (SDHC_EISTR) Timeout  */
#define SDHC_EISTR_DATTEO_NO                  (SDHC_EISTR_DATTEO_NO_Val << SDHC_EISTR_DATTEO_Pos)  /**< (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_DATTEO_YES                 (SDHC_EISTR_DATTEO_YES_Val << SDHC_EISTR_DATTEO_Pos) /**< (SDHC_EISTR) Timeout Position  */
#define SDHC_EISTR_DATCRC_Pos                 _U_(5)                                               /**< (SDHC_EISTR) Data CRC Error Position */
#define SDHC_EISTR_DATCRC_Msk                 (_U_(0x1) << SDHC_EISTR_DATCRC_Pos)                  /**< (SDHC_EISTR) Data CRC Error Mask */
#define SDHC_EISTR_DATCRC(value)              (SDHC_EISTR_DATCRC_Msk & ((value) << SDHC_EISTR_DATCRC_Pos))
#define   SDHC_EISTR_DATCRC_NO_Val            _U_(0x0)                                             /**< (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_DATCRC_YES_Val           _U_(0x1)                                             /**< (SDHC_EISTR) Error  */
#define SDHC_EISTR_DATCRC_NO                  (SDHC_EISTR_DATCRC_NO_Val << SDHC_EISTR_DATCRC_Pos)  /**< (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_DATCRC_YES                 (SDHC_EISTR_DATCRC_YES_Val << SDHC_EISTR_DATCRC_Pos) /**< (SDHC_EISTR) Error Position  */
#define SDHC_EISTR_DATEND_Pos                 _U_(6)                                               /**< (SDHC_EISTR) Data End Bit Error Position */
#define SDHC_EISTR_DATEND_Msk                 (_U_(0x1) << SDHC_EISTR_DATEND_Pos)                  /**< (SDHC_EISTR) Data End Bit Error Mask */
#define SDHC_EISTR_DATEND(value)              (SDHC_EISTR_DATEND_Msk & ((value) << SDHC_EISTR_DATEND_Pos))
#define   SDHC_EISTR_DATEND_NO_Val            _U_(0x0)                                             /**< (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_DATEND_YES_Val           _U_(0x1)                                             /**< (SDHC_EISTR) Error  */
#define SDHC_EISTR_DATEND_NO                  (SDHC_EISTR_DATEND_NO_Val << SDHC_EISTR_DATEND_Pos)  /**< (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_DATEND_YES                 (SDHC_EISTR_DATEND_YES_Val << SDHC_EISTR_DATEND_Pos) /**< (SDHC_EISTR) Error Position  */
#define SDHC_EISTR_CURLIM_Pos                 _U_(7)                                               /**< (SDHC_EISTR) Current Limit Error Position */
#define SDHC_EISTR_CURLIM_Msk                 (_U_(0x1) << SDHC_EISTR_CURLIM_Pos)                  /**< (SDHC_EISTR) Current Limit Error Mask */
#define SDHC_EISTR_CURLIM(value)              (SDHC_EISTR_CURLIM_Msk & ((value) << SDHC_EISTR_CURLIM_Pos))
#define   SDHC_EISTR_CURLIM_NO_Val            _U_(0x0)                                             /**< (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_CURLIM_YES_Val           _U_(0x1)                                             /**< (SDHC_EISTR) Power Fail  */
#define SDHC_EISTR_CURLIM_NO                  (SDHC_EISTR_CURLIM_NO_Val << SDHC_EISTR_CURLIM_Pos)  /**< (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_CURLIM_YES                 (SDHC_EISTR_CURLIM_YES_Val << SDHC_EISTR_CURLIM_Pos) /**< (SDHC_EISTR) Power Fail Position  */
#define SDHC_EISTR_ACMD_Pos                   _U_(8)                                               /**< (SDHC_EISTR) Auto CMD Error Position */
#define SDHC_EISTR_ACMD_Msk                   (_U_(0x1) << SDHC_EISTR_ACMD_Pos)                    /**< (SDHC_EISTR) Auto CMD Error Mask */
#define SDHC_EISTR_ACMD(value)                (SDHC_EISTR_ACMD_Msk & ((value) << SDHC_EISTR_ACMD_Pos))
#define   SDHC_EISTR_ACMD_NO_Val              _U_(0x0)                                             /**< (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_ACMD_YES_Val             _U_(0x1)                                             /**< (SDHC_EISTR) Error  */
#define SDHC_EISTR_ACMD_NO                    (SDHC_EISTR_ACMD_NO_Val << SDHC_EISTR_ACMD_Pos)      /**< (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_ACMD_YES                   (SDHC_EISTR_ACMD_YES_Val << SDHC_EISTR_ACMD_Pos)     /**< (SDHC_EISTR) Error Position  */
#define SDHC_EISTR_ADMA_Pos                   _U_(9)                                               /**< (SDHC_EISTR) ADMA Error Position */
#define SDHC_EISTR_ADMA_Msk                   (_U_(0x1) << SDHC_EISTR_ADMA_Pos)                    /**< (SDHC_EISTR) ADMA Error Mask */
#define SDHC_EISTR_ADMA(value)                (SDHC_EISTR_ADMA_Msk & ((value) << SDHC_EISTR_ADMA_Pos))
#define   SDHC_EISTR_ADMA_NO_Val              _U_(0x0)                                             /**< (SDHC_EISTR) No Error  */
#define   SDHC_EISTR_ADMA_YES_Val             _U_(0x1)                                             /**< (SDHC_EISTR) Error  */
#define SDHC_EISTR_ADMA_NO                    (SDHC_EISTR_ADMA_NO_Val << SDHC_EISTR_ADMA_Pos)      /**< (SDHC_EISTR) No Error Position  */
#define SDHC_EISTR_ADMA_YES                   (SDHC_EISTR_ADMA_YES_Val << SDHC_EISTR_ADMA_Pos)     /**< (SDHC_EISTR) Error Position  */
#define SDHC_EISTR_Msk                        _U_(0x03FF)                                          /**< (SDHC_EISTR) Register Mask  */

/* EMMC mode */
#define SDHC_EISTR_EMMC_BOOTAE_Pos            _U_(12)                                              /**< (SDHC_EISTR) Boot Acknowledge Error Position */
#define SDHC_EISTR_EMMC_BOOTAE_Msk            (_U_(0x1) << SDHC_EISTR_EMMC_BOOTAE_Pos)             /**< (SDHC_EISTR) Boot Acknowledge Error Mask */
#define SDHC_EISTR_EMMC_BOOTAE(value)         (SDHC_EISTR_EMMC_BOOTAE_Msk & ((value) << SDHC_EISTR_EMMC_BOOTAE_Pos))
#define   SDHC_EISTR_EMMC_BOOTAE_0_Val        _U_(0x0)                                             /**< (SDHC_EISTR) FIFO contains at least one byte  */
#define   SDHC_EISTR_EMMC_BOOTAE_1_Val        _U_(0x1)                                             /**< (SDHC_EISTR) FIFO is empty  */
#define SDHC_EISTR_EMMC_BOOTAE_0              (SDHC_EISTR_EMMC_BOOTAE_0_Val << SDHC_EISTR_EMMC_BOOTAE_Pos) /**< (SDHC_EISTR) FIFO contains at least one byte Position  */
#define SDHC_EISTR_EMMC_BOOTAE_1              (SDHC_EISTR_EMMC_BOOTAE_1_Val << SDHC_EISTR_EMMC_BOOTAE_Pos) /**< (SDHC_EISTR) FIFO is empty Position  */
#define SDHC_EISTR_EMMC_Msk                   _U_(0x1000)                                           /**< (SDHC_EISTR_EMMC) Register Mask  */


