c4deszes/atsame54-hal/atsame54-core/include/component/sdhc.h
/* -------- SDHC_HCVR : (SDHC Offset: 0xFE) ( R/ 16) Host Controller Version -------- */
#define SDHC_HCVR_RESETVALUE                  _U_(0x1802)                                          /**<  (SDHC_HCVR) Host Controller Version  Reset Value */

#define SDHC_HCVR_SVER_Pos                    _U_(0)                                               /**< (SDHC_HCVR) Spec Version Position */
#define SDHC_HCVR_SVER_Msk                    (_U_(0xFF) << SDHC_HCVR_SVER_Pos)                    /**< (SDHC_HCVR) Spec Version Mask */
#define SDHC_HCVR_SVER(value)                 (SDHC_HCVR_SVER_Msk & ((value) << SDHC_HCVR_SVER_Pos))
#define SDHC_HCVR_VVER_Pos                    _U_(8)                                               /**< (SDHC_HCVR) Vendor Version Position */
#define SDHC_HCVR_VVER_Msk                    (_U_(0xFF) << SDHC_HCVR_VVER_Pos)                    /**< (SDHC_HCVR) Vendor Version Mask */
#define SDHC_HCVR_VVER(value)                 (SDHC_HCVR_VVER_Msk & ((value) << SDHC_HCVR_VVER_Pos))
#define SDHC_HCVR_Msk                         _U_(0xFFFF)                                          /**< (SDHC_HCVR) Register Mask  */


/* -------- SDHC_MC1R : (SDHC Offset: 0x204) (R/W 8) MMC Control 1 -------- */
#define SDHC_MC1R_RESETVALUE                  _U_(0x00)                                            /**<  (SDHC_MC1R) MMC Control 1  Reset Value */

#define SDHC_MC1R_CMDTYP_Pos                  _U_(0)                                               /**< (SDHC_MC1R) e.MMC Command Type Position */
#define SDHC_MC1R_CMDTYP_Msk                  (_U_(0x3) << SDHC_MC1R_CMDTYP_Pos)                   /**< (SDHC_MC1R) e.MMC Command Type Mask */
#define SDHC_MC1R_CMDTYP(value)               (SDHC_MC1R_CMDTYP_Msk & ((value) << SDHC_MC1R_CMDTYP_Pos))
#define   SDHC_MC1R_CMDTYP_NORMAL_Val         _U_(0x0)                                             /**< (SDHC_MC1R) Not a MMC specific command  */
#define   SDHC_MC1R_CMDTYP_WAITIRQ_Val        _U_(0x1)                                             /**< (SDHC_MC1R) Wait IRQ Command  */
#define   SDHC_MC1R_CMDTYP_STREAM_Val         _U_(0x2)                                             /**< (SDHC_MC1R) Stream Command  */
#define   SDHC_MC1R_CMDTYP_BOOT_Val           _U_(0x3)                                             /**< (SDHC_MC1R) Boot Command  */
#define SDHC_MC1R_CMDTYP_NORMAL               (SDHC_MC1R_CMDTYP_NORMAL_Val << SDHC_MC1R_CMDTYP_Pos) /**< (SDHC_MC1R) Not a MMC specific command Position  */
#define SDHC_MC1R_CMDTYP_WAITIRQ              (SDHC_MC1R_CMDTYP_WAITIRQ_Val << SDHC_MC1R_CMDTYP_Pos) /**< (SDHC_MC1R) Wait IRQ Command Position  */
#define SDHC_MC1R_CMDTYP_STREAM               (SDHC_MC1R_CMDTYP_STREAM_Val << SDHC_MC1R_CMDTYP_Pos) /**< (SDHC_MC1R) Stream Command Position  */
#define SDHC_MC1R_CMDTYP_BOOT                 (SDHC_MC1R_CMDTYP_BOOT_Val << SDHC_MC1R_CMDTYP_Pos)  /**< (SDHC_MC1R) Boot Command Position  */
#define SDHC_MC1R_DDR_Pos                     _U_(3)                                               /**< (SDHC_MC1R) e.MMC HSDDR Mode Position */
#define SDHC_MC1R_DDR_Msk                     (_U_(0x1) << SDHC_MC1R_DDR_Pos)                      /**< (SDHC_MC1R) e.MMC HSDDR Mode Mask */
#define SDHC_MC1R_DDR(value)                  (SDHC_MC1R_DDR_Msk & ((value) << SDHC_MC1R_DDR_Pos))
#define SDHC_MC1R_OPD_Pos                     _U_(4)                                               /**< (SDHC_MC1R) e.MMC Open Drain Mode Position */
#define SDHC_MC1R_OPD_Msk                     (_U_(0x1) << SDHC_MC1R_OPD_Pos)                      /**< (SDHC_MC1R) e.MMC Open Drain Mode Mask */
#define SDHC_MC1R_OPD(value)                  (SDHC_MC1R_OPD_Msk & ((value) << SDHC_MC1R_OPD_Pos))
#define SDHC_MC1R_BOOTA_Pos                   _U_(5)                                               /**< (SDHC_MC1R) e.MMC Boot Acknowledge Enable Position */
#define SDHC_MC1R_BOOTA_Msk                   (_U_(0x1) << SDHC_MC1R_BOOTA_Pos)                    /**< (SDHC_MC1R) e.MMC Boot Acknowledge Enable Mask */
#define SDHC_MC1R_BOOTA(value)                (SDHC_MC1R_BOOTA_Msk & ((value) << SDHC_MC1R_BOOTA_Pos))
#define SDHC_MC1R_RSTN_Pos                    _U_(6)                                               /**< (SDHC_MC1R) e.MMC Reset Signal Position */
#define SDHC_MC1R_RSTN_Msk                    (_U_(0x1) << SDHC_MC1R_RSTN_Pos)                     /**< (SDHC_MC1R) e.MMC Reset Signal Mask */
#define SDHC_MC1R_RSTN(value)                 (SDHC_MC1R_RSTN_Msk & ((value) << SDHC_MC1R_RSTN_Pos))
#define SDHC_MC1R_FCD_Pos                     _U_(7)                                               /**< (SDHC_MC1R) e.MMC Force Card Detect Position */
#define SDHC_MC1R_FCD_Msk                     (_U_(0x1) << SDHC_MC1R_FCD_Pos)                      /**< (SDHC_MC1R) e.MMC Force Card Detect Mask */
#define SDHC_MC1R_FCD(value)                  (SDHC_MC1R_FCD_Msk & ((value) << SDHC_MC1R_FCD_Pos))
#define SDHC_MC1R_Msk                         _U_(0xFB)                                            /**< (SDHC_MC1R) Register Mask  */


/* -------- SDHC_MC2R : (SDHC Offset: 0x205) ( /W 8) MMC Control 2 -------- */
#define SDHC_MC2R_RESETVALUE                  _U_(0x00)                                            /**<  (SDHC_MC2R) MMC Control 2  Reset Value */

#define SDHC_MC2R_SRESP_Pos                   _U_(0)                                               /**< (SDHC_MC2R) e.MMC Abort Wait IRQ Position */
#define SDHC_MC2R_SRESP_Msk                   (_U_(0x1) << SDHC_MC2R_SRESP_Pos)                    /**< (SDHC_MC2R) e.MMC Abort Wait IRQ Mask */
#define SDHC_MC2R_SRESP(value)                (SDHC_MC2R_SRESP_Msk & ((value) << SDHC_MC2R_SRESP_Pos))
#define SDHC_MC2R_ABOOT_Pos                   _U_(1)                                               /**< (SDHC_MC2R) e.MMC Abort Boot Position */
#define SDHC_MC2R_ABOOT_Msk                   (_U_(0x1) << SDHC_MC2R_ABOOT_Pos)                    /**< (SDHC_MC2R) e.MMC Abort Boot Mask */
#define SDHC_MC2R_ABOOT(value)                (SDHC_MC2R_ABOOT_Msk & ((value) << SDHC_MC2R_ABOOT_Pos))
#define SDHC_MC2R_Msk                         _U_(0x03)                                            /**< (SDHC_MC2R) Register Mask  */


/* -------- SDHC_ACR : (SDHC Offset: 0x208) (R/W 32) AHB Control -------- */
#define SDHC_ACR_RESETVALUE                   _U_(0x00)                                            /**<  (SDHC_ACR) AHB Control  Reset Value */

#define SDHC_ACR_BMAX_Pos                     _U_(0)                                               /**< (SDHC_ACR) AHB Maximum Burst Position */
#define SDHC_ACR_BMAX_Msk                     (_U_(0x3) << SDHC_ACR_BMAX_Pos)                      /**< (SDHC_ACR) AHB Maximum Burst Mask */
#define SDHC_ACR_BMAX(value)                  (SDHC_ACR_BMAX_Msk & ((value) << SDHC_ACR_BMAX_Pos))
#define   SDHC_ACR_BMAX_INCR16_Val            _U_(0x0)                                             /**< (SDHC_ACR)   */
#define   SDHC_ACR_BMAX_INCR8_Val             _U_(0x1)                                             /**< (SDHC_ACR)   */
#define   SDHC_ACR_BMAX_INCR4_Val             _U_(0x2)                                             /**< (SDHC_ACR)   */
#define   SDHC_ACR_BMAX_SINGLE_Val            _U_(0x3)                                             /**< (SDHC_ACR)   */
#define SDHC_ACR_BMAX_INCR16                  (SDHC_ACR_BMAX_INCR16_Val << SDHC_ACR_BMAX_Pos)      /**< (SDHC_ACR)  Position  */
#define SDHC_ACR_BMAX_INCR8                   (SDHC_ACR_BMAX_INCR8_Val << SDHC_ACR_BMAX_Pos)       /**< (SDHC_ACR)  Position  */
#define SDHC_ACR_BMAX_INCR4                   (SDHC_ACR_BMAX_INCR4_Val << SDHC_ACR_BMAX_Pos)       /**< (SDHC_ACR)  Position  */
#define SDHC_ACR_BMAX_SINGLE                  (SDHC_ACR_BMAX_SINGLE_Val << SDHC_ACR_BMAX_Pos)      /**< (SDHC_ACR)  Position  */
#define SDHC_ACR_Msk                          _U_(0x00000003)                                      /**< (SDHC_ACR) Register Mask  */


/* -------- SDHC_CC2R : (SDHC Offset: 0x20C) (R/W 32) Clock Control 2 -------- */
#define SDHC_CC2R_RESETVALUE                  _U_(0x00)                                            /**<  (SDHC_CC2R) Clock Control 2  Reset Value */

